cfe llm/InformationRegisters/AI_ОчередьПодготовкиКВекторизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>AI_ОчередьПодготовкиКВекторизации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаПостановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfe llm/InformationRegisters/AI_ОчередьПодготовкиКВекторизации/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ПоставитьСсылкуВОчередь(Ссылка) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.AI_ОчередьПодготовкиКВекторизации.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Ссылка = Ссылка;
	МенеджерЗаписи.ДатаПостановки = ТекущаяДатаСеанса();
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры

Процедура УдалитьСсылкуИзОчереди(Ссылка) Экспорт
	
	НаборЗаписи = РегистрыСведений.AI_ОчередьПодготовкиКВекторизации.СоздатьНаборЗаписей();
	НаборЗаписи.Отбор.Ссылка.Установить(Ссылка);
	НаборЗаписи.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти
